const data = {
    "train": {
        "tag": "RRW",
        "status": 1
    },
    "wagons": {
        "w1": {
            "status": 1,
            "groups": {
                "Тяговый преобразователь": {
                    "status": 1,
                    "types": {
                        "Неисправность тягового преобразователя": {
                            "status": 1
                        },
                        "Неисправность двигателя вентилятора охлаждения": {
                            "status": 1
                        },
                        "Перегрев тягового преобразователя": {
                            "status": 1
                        }
                    }
                },
                "Тормозные резисторы": {
                    "status": 1,
                    "types": {
                        "Неисправность тормозных резисторов": {
                            "status": 1
                        },
                        "Перегрев": {
                            "status": 1
                        },
                        "Снижение сопротивления": {
                            "status": 1
                        }
                    }
                },
                "Контакторы высоковольтные": {
                    "status": 1,
                    "types": {
                        "Неисправность контакторов": {
                            "status": 1
                        },
                        "Выработка ресурса": {
                            "status": 1
                        }
                    }
                },
                "Тяговые электродвигатели": {
                    "status": 1,
                    "types": {
                        "Неисправность 1 ТЭД": {
                            "status": 1
                        },
                        "Неисправность 2 ТЭД": {
                            "status": 1
                        },
                        "Неисправность 3 ТЭД": {
                            "status": 1
                        },
                        "Неисправность 4 ТЭД": {
                            "status": 1
                        },
                        "Нарушение изоляции обмотки статора 1 ТЭД": {
                            "status": 1
                        },
                        "Нарушение изоляции обмотки статора 2 ТЭД": {
                            "status": 1
                        },
                        "Нарушение изоляции обмотки статора 3 ТЭД": {
                            "status": 1
                        },
                        "Нарушение изоляции обмотки статора 4 ТЭД": {
                            "status": 1
                        },
                        "Превышение токовых значений 1 ТЭД": {
                            "status": 1
                        },
                        "Превышение токовых значений 2 ТЭД": {
                            "status": 1
                        },
                        "Превышение токовых значений 3 ТЭД": {
                            "status": 1
                        },
                        "Превышение токовых значений 4 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подшипников 1 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подшипников 2 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подшипников 3 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подшипников 4 ТЭД": {
                            "status": 1
                        },
                        "Засорение фильтра 1 ТЭД": {
                            "status": 1
                        },
                        "Засорение фильтра 2 ТЭД": {
                            "status": 1
                        },
                        "Засорение фильтра 3 ТЭД": {
                            "status": 1
                        },
                        "Засорение фильтра 4 ТЭД": {
                            "status": 1
                        },
                        "Выработка ресурса 1 ТЭД": {
                            "status": 1
                        },
                        "Выработка ресурса 2 ТЭД": {
                            "status": 1
                        },
                        "Выработка ресурса 3 ТЭД": {
                            "status": 1
                        },
                        "Выработка ресурса 4 ТЭД": {
                            "status": 1
                        }
                    }
                },
                "Обогреватель лобового стекла": {
                    "status": 1,
                    "types": {
                        "Неисправность обогрева лобового стекла": {
                            "status": 1
                        },
                        "Снижение эксплуатационного ресурса": {
                            "status": 1
                        }
                    }
                },
                "Механическое оборудование": {
                    "status": 1,
                    "types": {
                        "Неисправность подшипника первой правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника первой левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника второй правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника второй левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника третьей правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника третьей левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника четвёртой правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника четвёртой левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса первой правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса первой левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса второй правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса второй левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса третьей правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса третьей левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса четвёртой правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса четвёртой левой буксы": {
                            "status": 1
                        },
                        "Неисправность демпферов рессорного подвешивания 1-ой тележки": {
                            "status": 1
                        },
                        "Неисправность демпферов рессорного подвешивания 2-ой тележки": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 1 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 2 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 3 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 4 ТЭД": {
                            "status": 1
                        }
                    }
                },
                "Тяговые редукторы": {
                    "status": 1,
                    "types": {
                        "Развитие трещин крышки редуктора 1": {
                            "status": 1
                        },
                        "Развитие трещин крышки редуктора 2": {
                            "status": 1
                        },
                        "Развитие трещин крышки редуктора 3": {
                            "status": 1
                        },
                        "Развитие трещин крышки редуктора 4": {
                            "status": 1
                        },
                        "Низкий уровень масла редуктора 1": {
                            "status": 1
                        },
                        "Низкий уровень масла редуктора 2": {
                            "status": 1
                        },
                        "Низкий уровень масла редуктора 3": {
                            "status": 1
                        },
                        "Низкий уровень масла редуктора 4": {
                            "status": 1
                        },
                        "Неисправность зубчатой передачи редуктора 1": {
                            "status": 1
                        },
                        "Неисправность зубчатой передачи  редуктора 2": {
                            "status": 1
                        },
                        "Неисправность зубчатой передачи  редуктора 3": {
                            "status": 1
                        },
                        "Неисправность зубчатой передачи  редуктора 4": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала малой шестерни редуктора 1": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала малой шестерни редуктора 2": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала малой шестерни редуктора 3": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала малой шестерни редуктора 4": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала промежуточной шестерни редуктора 1": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала промежуточной шестерни редуктора 2": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала промежуточной шестерни редуктора 3": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала промежуточной шестерни редуктора 4": {
                            "status": 1
                        },
                        "Неисправность опорных подшипников редуктора 1": {
                            "status": 1
                        },
                        "Неисправность опорных подшипников редуктора 2": {
                            "status": 1
                        },
                        "Неисправность опорных подшипников редуктора 3": {
                            "status": 1
                        },
                        "Неисправность опорных подшипников редуктора 4": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала малой шестерни редуктора 1": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала малой шестерни редуктора 2": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала малой шестерни редуктора 3": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала малой шестерни редуктора 4": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала промежуточной шестерни редуктора 1": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала промежуточной шестерни редуктора 2": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала промежуточной шестерни редуктора 3": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала промежуточной шестерни редуктора 4": {
                            "status": 1
                        },
                        "Металлические примеси в смазке редуктора 1": {
                            "status": 1
                        },
                        "Металлические примеси в смазке редуктора 2": {
                            "status": 1
                        },
                        "Металлические примеси в смазке редуктора 3": {
                            "status": 1
                        },
                        "Металлические примеси в смазке редуктора 4": {
                            "status": 1
                        },
                        "Неисправность зубчатой полумуфты редуктора 1": {
                            "status": 1
                        },
                        "Неисправность зубчатой полумуфты редуктора 2": {
                            "status": 1
                        },
                        "Неисправность зубчатой полумуфты редуктора 3": {
                            "status": 1
                        },
                        "Неисправность зубчатой полумуфты редуктора 4": {
                            "status": 1
                        }
                    }
                },
                "Тормозная система и пневматическое оборудование": {
                    "status": 1,
                    "types": {
                        "Неисправность тормозной системы (снижение тормозной эффективности поезда)": {
                            "status": 1
                        },
                        "Утечки из тормозной магистрали": {
                            "status": 1
                        },
                        "Утечки из питательной магистрали": {
                            "status": 1
                        }
                    }
                },
                "Система подачи песка": {
                    "status": 1,
                    "types": {
                        "Контроль наличия песка в бункере ": {
                            "status": 1
                        },
                        "Засор форсунки": {
                            "status": 1
                        }
                    }
                },
                "Двери и подножки": {
                    "status": 1,
                    "types": {
                        "Заклинивание редуктора двигателя первой правой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя первой левой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя второй правой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя второй левой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя первой правой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя первой левой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя второй правой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя второй левой двери": {
                            "status": 1
                        }
                    }
                },
                "Автосцепное оборудование": {
                    "status": 1,
                    "types": {
                        "Утечки воздуха в межвагонном сцепном устройстве": {
                            "status": 1
                        },
                        "Критичесские ударные нагрузки (толчок в пути, обрыв автосцепки)": {
                            "status": 1
                        },
                        "Неисправность обогрева автосцепки ": {
                            "status": 1
                        },
                        "Снижение эксплуатационного ресурса": {
                            "status": 1
                        }
                    }
                },
                "Система отопления вентиляции и кондиционирования (СКВ)": {
                    "status": 1,
                    "types": {
                        "Неисправность вентилятора конденсатора климатической установки": {
                            "status": 1
                        },
                        "Отказ компрессора климатической установки салона": {
                            "status": 1
                        },
                        "Неисправность нагревателя климатической установки": {
                            "status": 1
                        },
                        "Неисправность рециркуляционного отопителя": {
                            "status": 1
                        },
                        "Неисправность вентилятора приточного воздуха": {
                            "status": 1
                        },
                        "Неисправность осевого вентилятора": {
                            "status": 1
                        },
                        "Неисправность нагревателя 380 В": {
                            "status": 1
                        },
                        "Неисправность вентилятора теплообменника": {
                            "status": 1
                        },
                        "Неисправность СКВ вагона": {
                            "status": 1
                        },
                        "Неисправность СКВ кабины машиниста": {
                            "status": 1
                        }
                    }
                },
                "Системы внешнего освещения": {
                    "status": 1,
                    "types": {
                        "Неисправность прожектора": {
                            "status": 1
                        },
                        "Преждевременная выработка ресурса": {
                            "status": 1
                        }
                    }
                },
                "Система подачи звукового сигнала": {
                    "status": 1,
                    "types": {
                        "Неисправен тифон": {
                            "status": 1
                        },
                        "Засор тифона/свистка": {
                            "status": 1
                        }
                    }
                },
                "Санузел": {
                    "status": 1,
                    "types": {
                        "Неисправность санузла (общий сигнал)": {
                            "status": 1
                        },
                        "Низкое давление воздуха": {
                            "status": 1
                        },
                        "Утчески воздуха": {
                            "status": 1
                        },
                        "Засор вакуумного шибера": {
                            "status": 1
                        },
                        "Преждевременный расход воды": {
                            "status": 1
                        },
                        "Засор системы смыва": {
                            "status": 1
                        }
                    }
                },
                "Подсистема диагностики и оценки динамики показателей хода": {
                    "status": 1,
                    "types": {
                        "Датчик скорости ": {
                            "status": 1
                        },
                        "Плавность хода. Измерение пороговых значений": {
                            "status": 1
                        },
                        "Индикация состояния пути (неровности в плане)": {
                            "status": 1
                        },
                        "Индикация состояния пути (длинные неровности)": {
                            "status": 1
                        },
                        "Вертикальные ускорения": {
                            "status": 1
                        }
                    }
                },
                "Межвагонное сцепное устройство": {
                    "status": 1,
                    "types": {
                        "Критические ударные нагрузки": {
                            "status": 1
                        }
                    }
                }
            }
        },
        "w2": {
            "status": 1,
            "groups": {
                "Быстродействующий выключатель": {
                    "status": 1,
                    "types": {
                        "Неисправность БВ": {
                            "status": 1
                        },
                        "Выработка ресурса": {
                            "status": 1
                        }
                    }
                },
                "Дроссель тягового преобразователя": {
                    "status": 1,
                    "types": {
                        "Неисправность дросселя  ТП": {
                            "status": 1
                        },
                        "Нарушение теплового баланса": {
                            "status": 1
                        }
                    }
                },
                "Токоприемник": {
                    "status": 1,
                    "types": {
                        "Нарушение динамики хода ТП": {
                            "status": 1
                        },
                        "Неисправность полоза (Контроль качества нажатия ТП)": {
                            "status": 1
                        },
                        "Избыточное давление от перегрузок на контактный провод": {
                            "status": 1
                        },
                        "Преждевременный износ": {
                            "status": 1
                        }
                    }
                },
                "ПСН": {
                    "status": 1,
                    "types": {
                        "Другие типы отказов ПСН": {
                            "status": 1
                        },
                        "Нарушение системы охлаждения": {
                            "status": 1
                        },
                        "Сбой в работе модуля": {
                            "status": 1
                        }
                    }
                },
                "АКБ": {
                    "status": 1,
                    "types": {
                        "Преждевременный разряд аккумуляторной батареи": {
                            "status": 1
                        },
                        "Опасность глубокого разряда АБ": {
                            "status": 1
                        },
                        "Деградация АБ": {
                            "status": 1
                        }
                    }
                },
                "Механическое оборудование": {
                    "status": 1,
                    "types": {
                        "Неисправность подшипника первой правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника первой левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника второй правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника второй левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника третьей правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника третьей левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника четвёртой правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника четвёртой левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса первой правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса первой левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса второй правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса второй левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса третьей правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса третьей левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса четвёртой правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса четвёртой левой буксы": {
                            "status": 1
                        },
                        "Неисправность демпферов рессорного подвешивания 1-ой тележки": {
                            "status": 1
                        },
                        "Неисправность демпферов рессорного подвешивания 2-ой тележки": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 1 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 2 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 3 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 4 ТЭД": {
                            "status": 1
                        }
                    }
                },
                "Тормозная система и пневматическое оборудование": {
                    "status": 1,
                    "types": {
                        "Неисправность тормозной системы (снижение тормозной эффективности поезда)": {
                            "status": 1
                        },
                        "Утечки из тормозной магистрали": {
                            "status": 1
                        },
                        "Утечки из питательной магистрали": {
                            "status": 1
                        }
                    }
                },
                "Двери и подножки": {
                    "status": 1,
                    "types": {
                        "Заклинивание редуктора двигателя первой правой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя первой левой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя второй правой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя второй левой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя первой правой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя первой левой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя второй правой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя второй левой двери": {
                            "status": 1
                        }
                    }
                },
                "Система отопления вентиляции и кондиционирования (СКВ)": {
                    "status": 1,
                    "types": {
                        "Неисправность вентилятора конденсатора климатической установки": {
                            "status": 1
                        },
                        "Отказ компрессора климатической установки салона": {
                            "status": 1
                        },
                        "Неисправность нагревателя климатической установки": {
                            "status": 1
                        },
                        "Неисправность рециркуляционного отопителя": {
                            "status": 1
                        },
                        "Неисправность вентилятора приточного воздуха": {
                            "status": 1
                        },
                        "Неисправность осевого вентилятора": {
                            "status": 1
                        },
                        "Неисправность нагревателя 380 В": {
                            "status": 1
                        },
                        "Неисправность вентилятора теплообменника": {
                            "status": 1
                        },
                        "Неисправность СКВ вагона": {
                            "status": 1
                        },
                        "Неисправность СКВ кабины машиниста": {
                            "status": 1
                        }
                    }
                },
                "Подсистема диагностики и оценки динамики показателей хода": {
                    "status": 1,
                    "types": {
                        "Датчик скорости ": {
                            "status": 1
                        },
                        "Плавность хода. Измерение пороговых значений": {
                            "status": 1
                        },
                        "Индикация состояния пути (неровности в плане)": {
                            "status": 1
                        },
                        "Индикация состояния пути (длинные неровности)": {
                            "status": 1
                        },
                        "Вертикальные ускорения": {
                            "status": 1
                        }
                    }
                },
                "Межвагонное сцепное устройство": {
                    "status": 1,
                    "types": {
                        "Критические ударные нагрузки": {
                            "status": 1
                        }
                    }
                }
            }
        },
        "w3": {
            "status": 1,
            "groups": {
                "Механическое оборудование": {
                    "status": 1,
                    "types": {
                        "Неисправность подшипника первой правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника первой левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника второй правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника второй левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника третьей правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника третьей левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника четвёртой правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника четвёртой левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса первой правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса первой левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса второй правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса второй левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса третьей правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса третьей левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса четвёртой правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса четвёртой левой буксы": {
                            "status": 1
                        },
                        "Неисправность демпферов рессорного подвешивания 1-ой тележки": {
                            "status": 1
                        },
                        "Неисправность демпферов рессорного подвешивания 2-ой тележки": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 1 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 2 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 3 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 4 ТЭД": {
                            "status": 1
                        }
                    }
                },
                "Тормозная система и пневматическое оборудование": {
                    "status": 1,
                    "types": {
                        "Неисправность двигателя компрессорной установки Компрессор 1": {
                            "status": 1
                        },
                        "Неисправность двигателя компрессорной установки Компрессор 2": {
                            "status": 1
                        },
                        "Неисправность компрессора 1": {
                            "status": 1
                        },
                        "Неисправность компрессора 2": {
                            "status": 1
                        },
                        "Неисправность тормозной системы (снижение тормозной эффективности поезда)": {
                            "status": 1
                        },
                        "Утечки из тормозной магистрали": {
                            "status": 1
                        },
                        "Утечки из питательной магистрали": {
                            "status": 1
                        }
                    }
                },
                "Двери и подножки": {
                    "status": 1,
                    "types": {
                        "Заклинивание редуктора двигателя первой правой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя первой левой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя второй правой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя второй левой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя первой правой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя первой левой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя второй правой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя второй левой двери": {
                            "status": 1
                        }
                    }
                },
                "Система отопления вентиляции и кондиционирования (СКВ)": {
                    "status": 1,
                    "types": {
                        "Неисправность вентилятора конденсатора климатической установки": {
                            "status": 1
                        },
                        "Отказ компрессора климатической установки салона": {
                            "status": 1
                        },
                        "Неисправность нагревателя климатической установки": {
                            "status": 1
                        },
                        "Неисправность рециркуляционного отопителя": {
                            "status": 1
                        },
                        "Неисправность вентилятора приточного воздуха": {
                            "status": 1
                        },
                        "Неисправность осевого вентилятора": {
                            "status": 1
                        },
                        "Неисправность нагревателя 380 В": {
                            "status": 1
                        },
                        "Неисправность вентилятора теплообменника": {
                            "status": 1
                        },
                        "Неисправность СКВ вагона": {
                            "status": 1
                        },
                        "Неисправность СКВ кабины машиниста": {
                            "status": 1
                        }
                    }
                },
                "Подсистема диагностики и оценки динамики показателей хода": {
                    "status": 1,
                    "types": {
                        "Датчик скорости ": {
                            "status": 1
                        },
                        "Плавность хода. Измерение пороговых значений": {
                            "status": 1
                        },
                        "Индикация состояния пути (неровности в плане)": {
                            "status": 1
                        },
                        "Индикация состояния пути (длинные неровности)": {
                            "status": 1
                        },
                        "Вертикальные ускорения": {
                            "status": 1
                        }
                    }
                },
                "Межвагонное сцепное устройство": {
                    "status": 1,
                    "types": {
                        "Критические ударные нагрузки": {
                            "status": 1
                        }
                    }
                }
            }
        },
        "w4": {
            "status": 1,
            "groups": {
                "Быстродействующий выключатель": {
                    "status": 1,
                    "types": {
                        "Неисправность БВ": {
                            "status": 1
                        },
                        "Выработка ресурса": {
                            "status": 1
                        }
                    }
                },
                "Дроссель тягового преобразователя": {
                    "status": 1,
                    "types": {
                        "Неисправность дросселя  ТП": {
                            "status": 1
                        },
                        "Нарушение теплового баланса": {
                            "status": 1
                        }
                    }
                },
                "Токоприемник": {
                    "status": 1,
                    "types": {
                        "Нарушение динамики хода ТП": {
                            "status": 1
                        },
                        "Неисправность полоза (Контроль качества нажатия ТП)": {
                            "status": 1
                        },
                        "Избыточное давление от перегрузок на контактный провод": {
                            "status": 1
                        },
                        "Преждевременный износ": {
                            "status": 1
                        }
                    }
                },
                "ПСН": {
                    "status": 1,
                    "types": {
                        "Другие типы отказов ПСН": {
                            "status": 1
                        },
                        "Нарушение системы охлаждения": {
                            "status": 1
                        },
                        "Сбой в работе модуля": {
                            "status": 1
                        }
                    }
                },
                "АКБ": {
                    "status": 1,
                    "types": {
                        "Преждевременный разряд аккумуляторной батареи": {
                            "status": 1
                        },
                        "Опасность глубокого разряда АБ": {
                            "status": 1
                        },
                        "Деградация АБ": {
                            "status": 1
                        }
                    }
                },
                "Механическое оборудование": {
                    "status": 1,
                    "types": {
                        "Неисправность подшипника первой правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника первой левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника второй правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника второй левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника третьей правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника третьей левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника четвёртой правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника четвёртой левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса первой правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса первой левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса второй правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса второй левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса третьей правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса третьей левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса четвёртой правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса четвёртой левой буксы": {
                            "status": 1
                        },
                        "Неисправность демпферов рессорного подвешивания 1-ой тележки": {
                            "status": 1
                        },
                        "Неисправность демпферов рессорного подвешивания 2-ой тележки": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 1 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 2 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 3 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 4 ТЭД": {
                            "status": 1
                        }
                    }
                },
                "Тормозная система и пневматическое оборудование": {
                    "status": 1,
                    "types": {
                        "Неисправность тормозной системы (снижение тормозной эффективности поезда)": {
                            "status": 1
                        },
                        "Утечки из тормозной магистрали": {
                            "status": 1
                        },
                        "Утечки из питательной магистрали": {
                            "status": 1
                        }
                    }
                },
                "Двери и подножки": {
                    "status": 1,
                    "types": {
                        "Заклинивание редуктора двигателя первой правой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя первой левой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя второй правой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя второй левой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя первой правой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя первой левой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя второй правой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя второй левой двери": {
                            "status": 1
                        }
                    }
                },
                "Система отопления вентиляции и кондиционирования (СКВ)": {
                    "status": 1,
                    "types": {
                        "Неисправность вентилятора конденсатора климатической установки": {
                            "status": 1
                        },
                        "Отказ компрессора климатической установки салона": {
                            "status": 1
                        },
                        "Неисправность нагревателя климатической установки": {
                            "status": 1
                        },
                        "Неисправность рециркуляционного отопителя": {
                            "status": 1
                        },
                        "Неисправность вентилятора приточного воздуха": {
                            "status": 1
                        },
                        "Неисправность осевого вентилятора": {
                            "status": 1
                        },
                        "Неисправность нагревателя 380 В": {
                            "status": 1
                        },
                        "Неисправность вентилятора теплообменника": {
                            "status": 1
                        },
                        "Неисправность СКВ вагона": {
                            "status": 1
                        },
                        "Неисправность СКВ кабины машиниста": {
                            "status": 1
                        }
                    }
                },
                "Подсистема диагностики и оценки динамики показателей хода": {
                    "status": 1,
                    "types": {
                        "Датчик скорости ": {
                            "status": 1
                        },
                        "Плавность хода. Измерение пороговых значений": {
                            "status": 1
                        },
                        "Индикация состояния пути (неровности в плане)": {
                            "status": 1
                        },
                        "Индикация состояния пути (длинные неровности)": {
                            "status": 1
                        },
                        "Вертикальные ускорения": {
                            "status": 1
                        }
                    }
                },
                "Межвагонное сцепное устройство": {
                    "status": 1,
                    "types": {
                        "Критические ударные нагрузки": {
                            "status": 1
                        }
                    }
                }
            }
        },
        "w5": {
            "status": 1,
            "groups": {
                "Тяговый преобразователь": {
                    "status": 1,
                    "types": {
                        "Неисправность тягового преобразователя": {
                            "status": 1
                        },
                        "Неисправность двигателя вентилятора охлаждения": {
                            "status": 1
                        },
                        "Перегрев тягового преобразователя": {
                            "status": 1
                        }
                    }
                },
                "Тормозные резисторы": {
                    "status": 1,
                    "types": {
                        "Неисправность тормозных резисторов": {
                            "status": 1
                        },
                        "Перегрев": {
                            "status": 1
                        },
                        "Снижение сопротивления": {
                            "status": 1
                        }
                    }
                },
                "Контакторы высоковольтные": {
                    "status": 1,
                    "types": {
                        "Неисправность контакторов": {
                            "status": 1
                        },
                        "Выработка ресурса": {
                            "status": 1
                        }
                    }
                },
                "Тяговые электродвигатели": {
                    "status": 1,
                    "types": {
                        "Неисправность 1 ТЭД": {
                            "status": 1
                        },
                        "Неисправность 2 ТЭД": {
                            "status": 1
                        },
                        "Неисправность 3 ТЭД": {
                            "status": 1
                        },
                        "Неисправность 4 ТЭД": {
                            "status": 1
                        },
                        "Нарушение изоляции обмотки статора 1 ТЭД": {
                            "status": 1
                        },
                        "Нарушение изоляции обмотки статора 2 ТЭД": {
                            "status": 1
                        },
                        "Нарушение изоляции обмотки статора 3 ТЭД": {
                            "status": 1
                        },
                        "Нарушение изоляции обмотки статора 4 ТЭД": {
                            "status": 1
                        },
                        "Превышение токовых значений 1 ТЭД": {
                            "status": 1
                        },
                        "Превышение токовых значений 2 ТЭД": {
                            "status": 1
                        },
                        "Превышение токовых значений 3 ТЭД": {
                            "status": 1
                        },
                        "Превышение токовых значений 4 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подшипников 1 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подшипников 2 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подшипников 3 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подшипников 4 ТЭД": {
                            "status": 1
                        },
                        "Засорение фильтра 1 ТЭД": {
                            "status": 1
                        },
                        "Засорение фильтра 2 ТЭД": {
                            "status": 1
                        },
                        "Засорение фильтра 3 ТЭД": {
                            "status": 1
                        },
                        "Засорение фильтра 4 ТЭД": {
                            "status": 1
                        },
                        "Выработка ресурса 1 ТЭД": {
                            "status": 1
                        },
                        "Выработка ресурса 2 ТЭД": {
                            "status": 1
                        },
                        "Выработка ресурса 3 ТЭД": {
                            "status": 1
                        },
                        "Выработка ресурса 4 ТЭД": {
                            "status": 1
                        }
                    }
                },
                "Обогреватель лобового стекла": {
                    "status": 1,
                    "types": {
                        "Неисправность обогрева лобового стекла": {
                            "status": 1
                        },
                        "Снижение эксплуатационного ресурса": {
                            "status": 1
                        }
                    }
                },
                "Механическое оборудование": {
                    "status": 1,
                    "types": {
                        "Неисправность подшипника первой правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника первой левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника второй правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника второй левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника третьей правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника третьей левой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника четвёртой правой буксы": {
                            "status": 1
                        },
                        "Неисправность подшипника четвёртой левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса первой правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса первой левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса второй правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса второй левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса третьей правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса третьей левой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса четвёртой правой буксы": {
                            "status": 1
                        },
                        "Неисправность корпуса четвёртой левой буксы": {
                            "status": 1
                        },
                        "Неисправность демпферов рессорного подвешивания 1-ой тележки": {
                            "status": 1
                        },
                        "Неисправность демпферов рессорного подвешивания 2-ой тележки": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 1 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 2 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 3 ТЭД": {
                            "status": 1
                        },
                        "Неисправность подвески редуктора 4 ТЭД": {
                            "status": 1
                        }
                    }
                },
                "Тяговые редукторы": {
                    "status": 1,
                    "types": {
                        "Развитие трещин крышки редуктора 1": {
                            "status": 1
                        },
                        "Развитие трещин крышки редуктора 2": {
                            "status": 1
                        },
                        "Развитие трещин крышки редуктора 3": {
                            "status": 1
                        },
                        "Развитие трещин крышки редуктора 4": {
                            "status": 1
                        },
                        "Низкий уровень масла редуктора 1": {
                            "status": 1
                        },
                        "Низкий уровень масла редуктора 2": {
                            "status": 1
                        },
                        "Низкий уровень масла редуктора 3": {
                            "status": 1
                        },
                        "Низкий уровень масла редуктора 4": {
                            "status": 1
                        },
                        "Неисправность зубчатой передачи редуктора 1": {
                            "status": 1
                        },
                        "Неисправность зубчатой передачи  редуктора 2": {
                            "status": 1
                        },
                        "Неисправность зубчатой передачи  редуктора 3": {
                            "status": 1
                        },
                        "Неисправность зубчатой передачи  редуктора 4": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала малой шестерни редуктора 1": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала малой шестерни редуктора 2": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала малой шестерни редуктора 3": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала малой шестерни редуктора 4": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала промежуточной шестерни редуктора 1": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала промежуточной шестерни редуктора 2": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала промежуточной шестерни редуктора 3": {
                            "status": 1
                        },
                        "Подклинивание или изгиб вала промежуточной шестерни редуктора 4": {
                            "status": 1
                        },
                        "Неисправность опорных подшипников редуктора 1": {
                            "status": 1
                        },
                        "Неисправность опорных подшипников редуктора 2": {
                            "status": 1
                        },
                        "Неисправность опорных подшипников редуктора 3": {
                            "status": 1
                        },
                        "Неисправность опорных подшипников редуктора 4": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала малой шестерни редуктора 1": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала малой шестерни редуктора 2": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала малой шестерни редуктора 3": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала малой шестерни редуктора 4": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала промежуточной шестерни редуктора 1": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала промежуточной шестерни редуктора 2": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала промежуточной шестерни редуктора 3": {
                            "status": 1
                        },
                        "Неисправность подшипникового узла вала промежуточной шестерни редуктора 4": {
                            "status": 1
                        },
                        "Металлические примеси в смазке редуктора 1": {
                            "status": 1
                        },
                        "Металлические примеси в смазке редуктора 2": {
                            "status": 1
                        },
                        "Металлические примеси в смазке редуктора 3": {
                            "status": 1
                        },
                        "Металлические примеси в смазке редуктора 4": {
                            "status": 1
                        },
                        "Неисправность зубчатой полумуфты редуктора 1": {
                            "status": 1
                        },
                        "Неисправность зубчатой полумуфты редуктора 2": {
                            "status": 1
                        },
                        "Неисправность зубчатой полумуфты редуктора 3": {
                            "status": 1
                        },
                        "Неисправность зубчатой полумуфты редуктора 4": {
                            "status": 1
                        }
                    }
                },
                "Тормозная система и пневматическое оборудование": {
                    "status": 1,
                    "types": {
                        "Неисправность тормозной системы (снижение тормозной эффективности поезда)": {
                            "status": 1
                        },
                        "Утечки из тормозной магистрали": {
                            "status": 1
                        },
                        "Утечки из питательной магистрали": {
                            "status": 1
                        }
                    }
                },
                "Система подачи песка": {
                    "status": 1,
                    "types": {
                        "Контроль наличия песка в бункере ": {
                            "status": 1
                        },
                        "Засор форсунки": {
                            "status": 1
                        }
                    }
                },
                "Двери и подножки": {
                    "status": 1,
                    "types": {
                        "Заклинивание редуктора двигателя первой правой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя первой левой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя второй правой двери": {
                            "status": 1
                        },
                        "Заклинивание редуктора двигателя второй левой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя первой правой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя первой левой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя второй правой двери": {
                            "status": 1
                        },
                        "Отказ электродвигателя второй левой двери": {
                            "status": 1
                        }
                    }
                },
                "Автосцепное оборудование": {
                    "status": 1,
                    "types": {
                        "Утечки воздуха в межвагонном сцепном устройстве": {
                            "status": 1
                        },
                        "Критичесские ударные нагрузки (толчок в пути, обрыв автосцепки)": {
                            "status": 1
                        },
                        "Неисправность обогрева автосцепки ": {
                            "status": 1
                        },
                        "Снижение эксплуатационного ресурса": {
                            "status": 1
                        }
                    }
                },
                "Система отопления вентиляции и кондиционирования (СКВ)": {
                    "status": 1,
                    "types": {
                        "Неисправность вентилятора конденсатора климатической установки": {
                            "status": 1
                        },
                        "Отказ компрессора климатической установки салона": {
                            "status": 1
                        },
                        "Неисправность нагревателя климатической установки": {
                            "status": 1
                        },
                        "Неисправность рециркуляционного отопителя": {
                            "status": 1
                        },
                        "Неисправность вентилятора приточного воздуха": {
                            "status": 1
                        },
                        "Неисправность осевого вентилятора": {
                            "status": 1
                        },
                        "Неисправность нагревателя 380 В": {
                            "status": 1
                        },
                        "Неисправность вентилятора теплообменника": {
                            "status": 1
                        },
                        "Неисправность СКВ вагона": {
                            "status": 1
                        },
                        "Неисправность СКВ кабины машиниста": {
                            "status": 1
                        }
                    }
                },
                "Системы внешнего освещения": {
                    "status": 1,
                    "types": {
                        "Неисправность прожектора": {
                            "status": 1
                        },
                        "Преждевременная выработка ресурса": {
                            "status": 1
                        }
                    }
                },
                "Система подачи звукового сигнала": {
                    "status": 1,
                    "types": {
                        "Неисправен тифон": {
                            "status": 1
                        },
                        "Засор тифона/свистка": {
                            "status": 1
                        }
                    }
                },
                "Санузел": {
                    "status": 1,
                    "types": {
                        "Неисправность санузла (общий сигнал)": {
                            "status": 1
                        },
                        "Низкое давление воздуха": {
                            "status": 1
                        },
                        "Утчески воздуха": {
                            "status": 1
                        },
                        "Засор вакуумного шибера": {
                            "status": 1
                        },
                        "Преждевременный расход воды": {
                            "status": 1
                        },
                        "Засор системы смыва": {
                            "status": 1
                        }
                    }
                },
                "Подсистема диагностики и оценки динамики показателей хода": {
                    "status": 1,
                    "types": {
                        "Датчик скорости ": {
                            "status": 1
                        },
                        "Плавность хода. Измерение пороговых значений": {
                            "status": 1
                        },
                        "Индикация состояния пути (неровности в плане)": {
                            "status": 1
                        },
                        "Индикация состояния пути (длинные неровности)": {
                            "status": 1
                        },
                        "Вертикальные ускорения": {
                            "status": 1
                        }
                    }
                },
                "Межвагонное сцепное устройство": {
                    "status": 1,
                    "types": {
                        "Критические ударные нагрузки": {
                            "status": 1
                        }
                    }
                }
            }
        }
    }
};




function printData(obj, indent = 0) {
    for (const key in obj) {
        if (typeof obj[key] === "object") {
            console.log("  ".repeat(indent) + key + ": {");
            printData(obj[key], indent + 1);
            console.log("  ".repeat(indent) + "}");
        } else {
            console.log("  ".repeat(indent) + key + ": " + obj[key]);
        }
    }
}

// Используйте функцию, чтобы вывести все данные из JSON-объекта:
printData(data);
